{
  "slogan-1": "关于我们",
  "slogan-2": "ABOUT US",
  "boss-name": "Establish",
  "boss-profile-1": "Our Company was established and incorporated in 2013 by our founder, Mr Hui Xuan, with the aim of providing fresh vegetables to our customers.",
  "boss-profile-2": "Throughout the years, we have evolved to include fruits, frozen meat, and provisions and seasonings to our supplies.",
  "profile-1-title": "Explore",
  "profile-1-text": "During the early years, our business focused on providing goods to business-to-business (B2B) segment, fulfilling the needs of F&B businesses with fresh ingredients.  ",
  "profile-1-text2": "In year 2020, we have also launched our business-to-consumer (B2C) segment, delivering goods directly to their homes.",
  "profile-2-title": "Innovation",
  "profile-2-text": "Our success was mostly attributed to the change from traditional handwritten invoices to employing technology to boost productivity and efficiency while fulfilling customer orders. ",
  "profile-2-text2": "Through this mean, we are able to meet increased consumer demand while reducing the chance that an order would be missed and negatively affect our customers' business.",
  "profile-3-title": "System",
  "profile-3-text": "The backbone of our Company lies with the ERP system that was developed by our own IT department which helped the entire process of our Company from purchases to sales including warehouse management system that caters for B2B segment. ",
  "profile-3-text2": "Besides, we also have a dedicated system to serve our B2C customers. These system includes both web-based and mobile application so as to improve the user experience for all our customers.",
  "profile-4-title": "Service",
  "profile-4-text": "We pride ourselves on being able to offer 24/7 customer support to guarantee that your voice is heard punctually, and you are attended to swiftly. ",
  "profile-4-text2": "In order to serve our customers well, we also have our own delivery fleet to ensure orders are fulfilled.",
  "profile-5-title": "Cooperation",
  "profile-5-text": "In the course of our years of business, we have been able to retain a number of long-term clients, these includes Hai Di Lao, TanYu and other Chinese cuisine eateries. ",
  "profile-5-text2": "The organisation has experienced remarkable development throughout the years as a result in gaining these long-term partnerships whereby we've crossed tenth million annual sales by the fifth year of operation.",
  "profile-6-title": "Expansion",
  "profile-6-text": "In 2022, we expanded our operation to Johor, Malaysia, with the aim of providing fresh ingredients to the Johor market. ",
  "profile-6-text2": "This accomplishment represents yet another clear outcome of the company's market penetration.",
  "mission-title": "Mission",
  "mission-text": "We nourish the People of Singapore with the freshest provisions daily at the most affordable price to attain a lower standard of living in this fast-paced environment.",
  "vision-title": "Vision",
  "vision-text": "We envision the integration of the traditional wholesale manufacturing trade into a digitalised environment to take on challenges in the world of information technology to improve the quality of our lives.",
  "finance-title": "Financial Performance",
  "finance-1": "For our Company, the past ten years have been a successful adventure. From a brand-new startup with more than one million sales in our first year of business, we increased to 33 million sales in the previous fiscal year. ",
  "finance-2": "The first million dollars in cumulative income was earned in the first year of operation, the tenth million dollars in the third year, and the hundred million dollars in the eighth year.",
  "environment-title": "Company Environment"
}
